app/views/dislikes/index.html.erb

SELECT "dislikes".* FROM "dislikes" WHERE "dislikes"."user_id" = ?  [["user_id", 1]]
---

      <% current_user.dislikes.each do |dislike| %>