app/views/copays/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."copay_id" = ?  [["copay_id", 6]]
---

  <% copay.comments.each do |comment| %>