app/views/comments/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
---

      <% current_user.comments.each do |comment| %>