app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @comment = Comment.find(params[:id])

INSERT INTO "comments" ("body", "user_id", "copay_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "good card"], ["user_id", 4], ["copay_id", 1], ["created_at", "2017-06-11 04:33:48.827422"], ["updated_at", "2017-06-11 04:33:48.827422"]]
---
  def create
    @comment = Comment.new

    @comment.body = params[:body]
    @comment.user_id = params[:user_id]
    @comment.copay_id = params[:copay_id]

    save_status = @comment.save