app/controllers/dislikes_controller.rb

SELECT  "dislikes".* FROM "dislikes" WHERE "dislikes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @dislike = Dislike.find(params[:id])

INSERT INTO "dislikes" ("user_id", "copay_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["copay_id", 1], ["created_at", "2017-06-11 04:47:57.007471"], ["updated_at", "2017-06-11 04:47:57.007471"]]
---
  def create
    @dislike = Dislike.new

    @dislike.user_id = params[:user_id]
    @dislike.copay_id = params[:copay_id]

    save_status = @dislike.save

SELECT  "dislikes".* FROM "dislikes" WHERE "dislikes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @dislike = Dislike.find(params[:id])